DataProcessors/ОтчетПродажиИВозвраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОтчетПродажиИВозвраты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОС_ДанныеПродажДляМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОС_ДанныеПродажДляМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПродажиКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажиСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратыКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратыСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОтчетПродажиИВозвраты/Forms/ФормаПоНакладным/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет ()
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПродаж.Дата КАК Дата,
	|	СУММА(ДанныеПродаж.ПродажиСумма) КАК Продажи,
	|	СУММА(ДанныеПродаж.ВозвратыСумма) КАК Возвраты,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеПродаж.ВозвратыКоличество <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВозвратыSKU,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеПродаж.ПродажиКоличество <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПродажиSKU
	|ИЗ
	|	РегистрСведений.ОС_ДанныеПродажДляМП КАК ДанныеПродаж
	|ГДЕ
	|	ДанныеПродаж.Контрагент = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПродаж.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Контрагент" ,Контрагент);
	
	ИтогПродажи  = 0;
	ИтогВозвраты = 0;
	
	Результат.Очистить();
	//НоваяСтрока = Результат.Добавить();
	//НоваяСтрока.Операция = "Тест";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Продажи <> 0 Тогда
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Дата = Выборка.Дата;
			НоваяСтрока.Операция = "Продажа";
			НоваяСтрока.КоличествоSKU = Выборка.ПродажиSKU;
			НоваяСтрока.Сумма = Выборка.Продажи;			
		КонецЕсли;
		Если Выборка.Возвраты <> 0 Тогда
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Дата = Выборка.Дата;
			НоваяСтрока.Операция = "Возврат";
			НоваяСтрока.КоличествоSKU = Выборка.ВозвратыSKU;
			НоваяСтрока.Сумма = Выборка.Возвраты;			
		КонецЕсли;		
		ИтогПродажи  = ИтогПродажи  + Выборка.Продажи; 
		ИтогВозвраты = ИтогВозвраты + Выборка.Возвраты; 		
	КонецЦикла;	
	
	Если Результат.Количество() = 0 Тогда
		Элементы.ДекорацияНетДанных.Заголовок = "<< НЕТ ДАННЫХ >>";
	Иначе
		Элементы.ДекорацияНетДанных.Заголовок = "Итого: " + ИтогПродажи + " - " + (-ИтогВозвраты) + " = " + (ИтогПродажи + ИтогВозвраты) + " р.";
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура РезультатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Обработка.ОтчетПродажиИВозвраты.Форма.Форма", Новый Структура("Контрагент, Дата, Операция",Контрагент, Элемент.ТекущиеДанные.Дата, Элемент.ТекущиеДанные.Операция));
КонецПроцедуры
